In [4]:
import pandas as pd

# Practice problem II

In [5]:
# load the Alcohol consumption by country dataset
path = 'https://raw.githubusercontent.com/um-perez-alvaro/Data-Science-Practice/master/Data/drinks.csv'
df = pd.read_csv(path, index_col='country')

Display the first 10 entries of the dataset

In [34]:
df.head(10)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0
Albania,89,132,54,4.9
Algeria,25,0,14,0.7
Andorra,245,138,312,12.4
Antigua & Barbuda,102,128,45,4.9
Argentina,193,25,221,8.3
Armenia,21,179,11,3.8
Australia,261,72,212,10.4
Austria,279,75,191,9.7
Azerbaijan,21,46,5,1.3

What is the number of observations (rows) in the dataset?

In [10]:
len(df)

193

What is the number of columns in the dataset?

In [12]:
df.shape[1]

5

Print the name of all the columns.

In [35]:
print(*df.columns, sep=", ")

beer_servings, spirit_servings, wine_servings, total_litres_of_pure_alcohol

print data for Albania (using loc)

In [16]:
df.loc['Albania']

beer_servings                       89
spirit_servings                    132
wine_servings                       54
total_litres_of_pure_alcohol       4.9
continent                       Europe
Name: Albania, dtype: object

print data for USA and Spain (using loc)

In [19]:
df.loc[['USA','Spain']]

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
country,,,,,
USA,249,158,84,8.7,North America
Spain,284,157,112,10.0,Europe

drop the `continent` column

In [20]:
df.drop(columns=['continent'], inplace=True)
df.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0
Albania,89,132,54,4.9
Algeria,25,0,14,0.7
Andorra,245,138,312,12.4
Angola,217,57,45,5.9

drop the row corresponding to Angola

In [23]:
df.drop('Angola', inplace=True)
df.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
country,,,,
Afghanistan,0,0,0,0.0
Albania,89,132,54,4.9
Algeria,25,0,14,0.7
Andorra,245,138,312,12.4
Antigua & Barbuda,102,128,45,4.9

Print out `wine_servings` data for France

In [36]:
print(df.loc['France', 'wine_servings'])

370

Print out `total_litres_of_pure_alcohol` column three different ways

In [33]:
# bracket notation
df['total_litres_of_pure_alcohol']
# dot notation
df.total_litres_of_pure_alcohol
# loc accessor
df.loc[:, 'total_litres_of_pure_alcohol']

country
Afghanistan           0.0
Albania               4.9
Algeria               0.7
Andorra              12.4
Antigua & Barbuda     4.9
                     ...
Venezuela             7.7
Vietnam               2.0
Yemen                 0.1
Zambia                2.5
Zimbabwe              4.7
Name: total_litres_of_pure_alcohol, Length: 192, dtype: float64